Revit 2027 API
Material Properties
The Material type exposes the following members.
Properties
Name | Description
AppearanceAssetId |  The ElementId of the AppearanceAssetElement.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
Color |  The color of the material.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
CutBackgroundPatternColor |  The color of the material cut background pattern.
CutBackgroundPatternId |  The id of the FillPatternElement used as the background pattern of faces with this material in cut views.
CutForegroundPatternColor |  The color of the material cut foreground pattern.
CutForegroundPatternId |  The id of the FillPatternElement used as the foreground pattern of faces with this material in cut views.
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
EmbodiedCarbonAssetId |  The ElementId of the embodied carbon PropertySetElement.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
MaterialCategory |  The name of the material category, e.g. 'Wood'
MaterialClass |  The name of the general material type, e.g. 'Wood.'
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
Shininess |  The shininess of the material.
Smoothness |  The smoothness of the material.
StructuralAssetId |  The ElementId of the structural PropertySetElement.
SurfaceBackgroundPatternColor |  The color of the material surface background pattern.
SurfaceBackgroundPatternId |  The id of the FillPatternElement used as the background pattern of faces with this material in normal views.
SurfaceForegroundPatternColor |  The color of the material surface foreground pattern.
SurfaceForegroundPatternId |  The id of the FillPatternElement used as the foreground pattern of faces with this material in normal views.
ThermalAssetId |  The ElementId of the thermal PropertySetElement.
Transparency |  The transparency of the material.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
UseRenderAppearanceForShading |  True to use the render appearance settings for shaded view appearance; false to use the material's color and transparency value for shaded view appearance.
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace